app/views/posts/index.html.erb

        <p class="fw-bold">Comments:</p>
        <% post.comments.last(3).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."id" DESC LIMIT ?  [["post_id", 1], ["LIMIT", 3]]