app/views/posts/show.html.erb

  <h5><strong>Comments</strong></h5>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]