app/controllers/password_resets_controller.rb

  def create
    allert = "We have sent a link to reset your password"
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]