app/controllers/posts_controller.rb

  def create_comment
    @post = Post.find(params[:id])
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "name", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 11], ["post_id", 1], ["name", nil], ["comment", "sadsadasdsd"], ["created_at", "2023-07-08 21:39:24.332889"], ["updated_at", "2023-07-08 21:39:24.332889"]]
INSERT INTO "posts" ("title", "photo", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdfsdf"], ["photo", "sdf"], ["text", "sdf"], ["user_id", 11], ["created_at", "2023-07-08 20:14:42.342051"], ["updated_at", "2023-07-08 20:14:42.342051"]]

  def create
    @post = Current.user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "photo", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "photo" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["photo", "https://www.visa.cz/dam/VCOM/global/pay-with-visa/images/google-pay-phone-1600x900.jpg"], ["updated_at", "2023-07-08 22:01:44.999690"], ["id", 5]]