app/controllers/registrations_controller.rb

  def create
    # render plain: "Thanks for signing up!"
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "qwerty12@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-07-08 15:13:16.182856"], ["updated_at", "2023-07-08 15:13:16.182856"]]